#### Terraform Plan (welcome)

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloudfront.aws_cloudfront_distribution.main will be updated in-place
  ~ resource "aws_cloudfront_distribution" "main" {
        id                              = "E1F1GN3A1B3EIY"
        tags                            = {
            "Environment" = "welcome"
            "ManagedBy"   = "terraform"
            "Project"     = "welcome-web"
        }
        # (24 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "welcome-web-alb-1012923022.eu-north-1.elb.amazonaws.com" -> null
          - origin_id                   = "alb-origin" -> null
          - response_completion_timeout = 0 -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "https-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "alb-origin-welcome.shaeed.co.uk"
          + origin_id                   = "alb-origin"
          + response_completion_timeout = (known after apply)
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-north-1:982890094160:task-definition/welcome-web-task:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-north-1:982890094160:task-definition/welcome-web-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  ~ image            = "982890094160.dkr.ecr.eu-north-1.amazonaws.com/welcome-web:d5aa3b95cc84" -> "982890094160.dkr.ecr.eu-north-1.amazonaws.com/welcome-web:latest"
                  - mountPoints      = []
                    name             = "welcome-web"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "welcome-web-task" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "Environment" = "welcome"
            "ManagedBy"   = "terraform"
            "Name"        = "welcome-web-task"
            "Project"     = "welcome-web"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
*Pushed by: @shaeed-noordeen, Action: `pull_request`*